const enum_DB_MemberInfo = {
	ID				:0,		// id
	Name			:1,		// トレーナー名
	TrainerID		:2,		// トレーナーID
	Title			:3,		// 称号
	TeamRank		:4,		// トレーナーランク
	TeamRankPoint	:5,		// トレーナーランク点
	TextComment		:6,		// 一言コメント
	DirectoryLv		:7,		// 名鑑Lv
	IconCharID		:8,		// アイコンキャラ
};

const DB_Member_Info = [
	[1001,	"ヴァニラ",			"",		"小さな頑張り屋"],
	[1002,	"むにえる",			"",		""],
	[1003,	"ぐましぃ",			"",		""],
	[1004,	"れじすた",			"",		""],
	[1005,	"REON",				"",		""],
	[1006,	"みやび",			"",		""],
	[1007,	"ハイダラ",			"",		""],
	[1008,	"猾仙",				"",		""],
	[1009,	"黒郷雨",			"",		""],
	[1010,	"おマチ",			"",		""],
	[1011,	"とあ",				"",		""],
	[1012,	"なんこつ",			"",		""],
	[1013,	"ミカ",				"",		""],
	[1014,	"閻魔",				"",		""],
	[1015,	"そらお",			"",		""],
	[1016,	"ノーデ",			"",		""],
	[1017,	"うしうし",			"",		""],
	[1018,	"セーレン",			"",		""],
	[1019,	"takkun",			"",		""],
	[1020,	"にふにふ",			"",		""],
	[1021,	"マサ",				"",		""],
	[1022,	"ぽよだい",			"",		""],
	[1023,	"春はあげぽよ",		"",		""],
	[1024,	"テミ",				"",		""],
	[1025,	"ヤス",				"",		""],
	[1026,	"きりゆたんぽ",		"",		""],
	[1027,	"108",				"",		""],
	[1028,	"オにーさマン",		"",		""],
	[1029,	"うーましぶ",		"",		""],
	[1030,	"ぷー",				"",		""],
	[1031,	"イツキ",			"",		""],
	[1032,	"ヒナ",				"",		""],
	[1033,	"シャカトレ",		"",		""],
	[1100,	"鈴八",				"",		""],
	[1101,	"不純ブンガク",		"",		""],
	[1102,	"れおん",			"",		""],
	[1103,	"蒼龍",				"",		""],
	[1104,	"あすく",			"",		""],
	[1105,	"カラス",			"",		""],
	[1106,	"はご",				"",		""],
	[1107,	"みざくら",			"",		""],
	[1108,	"ナタデココ",		"",		""],
	[1109,	"ディシュパー",		"",		""],
	[1110,	"あたし",			"",		""],
	[1111,	"時津風",			"",		""],
	[1112,	"八雲",				"",		""],
	[1113,	"オムレツ",			"",		""],
	[1114,	"ボンレス兄貴",		"",		""],
	[1115,	"セシル",			"",		""],
	[1116,	"でんげん",			"",		""],
	[1117,	"さめはだ",			"",		""],
	[1118,	"たきざあ",			"",		""],
	[1119,	"チョラン",			"",		""],
	[1120,	"まるまる",			"",		""],
	[1121,	"ごろー",			"",		""],
];


/*******************************************************************************************************
 * 関数名	fnc_DB_Get_Member_Info
 * 概要		idからメンバーのデータを取得
 * I/O		id		: メンバーのID
 *			data	: 取得するデータの種類
 * return	メンバーのデータ
 * 更新日	2025/09/20	新規
 *******************************************************************************************************/
function fnc_DB_Get_Member_Info(id, data) {
	let retName = "";

    for(let idx = 0; idx < DB_Member_Info.length; idx++) {
        if(DB_Member_Info[idx][enum_DB_MemberInfo.ID] == id) {
            retName = DB_Member_Info[idx][data];
            break;
        }
    }

    return retName;
}
